In [4]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import mysql.connector

db = mysql.connector.connect(host = "localhost",
                            username = "root",
                            password = "Tasbiha@1234",
                            database = "ecommerce")

cur = db.cursor()

# 1. List all unique cities where customers are located.

In [5]:
query = """
SELECT DISTINCT
    customer_city
FROM
    customers AS unique_citiesa;
"""
cur.execute(query)
data = cur.fetchall()
df = pd.DataFrame(data)
df.head()

                       0
0                 franca
1  sao bernardo do campo
2              sao paulo
3        mogi das cruzes
4               campinas

## **2. Count the number of orders placed in 2017.**

In [4]:
query = """
SELECT 
    count(order_id)
FROM
    orders
WHERE
    YEAR(order_purchase_timestamp) = '2017';
"""

cur.execute(query)
data = cur.fetchall()
"total order placed in year 2017 are: ", data[0][0]

('total order placed in year 2017 are: ', 45101)

# 3. Find the total sales per category.

In [9]:
query = """
SELECT 
    upper(products.product_category) AS 'category',
    ROUND(SUM(payments.payment_value), 2) AS 'sales'
FROM
    products
        JOIN
    order_items ON products.product_id = order_items.product_id
        JOIN
    payments ON payments.order_id = order_items.order_id
GROUP BY category;
"""
cur.execute(query)
data = cur.fetchall()
df = pd.DataFrame(data, columns = ["Category", "Sales"])
df.head()

               Category       Sales
0             PERFUMERY   506738.66
1  FURNITURE DECORATION  1430176.39
2             TELEPHONY   486882.05
3        BED TABLE BATH  1712553.67
4            AUTOMOTIVE   852294.33

# 4. Calculate the percentage of orders that were paid in installments.

In [13]:
query = """
SELECT 
    (SUM(CASE
        WHEN payment_installments >= 1 THEN 1
        ELSE 0
    END)) / COUNT(*) * 100
FROM
    payments;
"""

cur.execute(query)
data = cur.fetchall()
"the percentage of orders that were paid in installments", data[0][0]

('the percentage of orders that were paid in installments', Decimal('99.9981'))